In [2]:
import pandas as pd
import numpy as np

In [39]:
d1 = pd.DataFrame(np.random.randint(30,size=(3,3)),columns=['a','b','c']) 
d1

    a   b   c
0  18   1   0
1  16  25  28
2  21   9  22

In [40]:
d2 = pd.DataFrame(np.random.randint(30,size=(3,3)),columns=['p','q','r']) 
d2

    p   q   r
0  24   5  12
1  23  14  29
2  11   9   7

In [41]:
pd.concat([d1,d2])

      a     b     c     p     q     r
0  18.0   1.0   0.0   NaN   NaN   NaN
1  16.0  25.0  28.0   NaN   NaN   NaN
2  21.0   9.0  22.0   NaN   NaN   NaN
0   NaN   NaN   NaN  24.0   5.0  12.0
1   NaN   NaN   NaN  23.0  14.0  29.0
2   NaN   NaN   NaN  11.0   9.0   7.0

In [27]:
d3 = pd.DataFrame(np.random.randint(30,size=(3,3)),index=['a','b','c']) 
d3

    0   1   2
a   0   6   5
b  10   0  24
c  13  27  16

In [28]:
pd.concat([d1,d2,d3],axis=1)

    0   1   2   0   1   2   0   1   2
a  24   5   1  17   8  28   0   6   5
b  23  29  25  18   7  15  10   0  24
c   7   3  17  23  12  25  13  27  16